//CABIN11R JOB (CABS,INGST),'K.ADEYEMI',CLASS=B,MSGCLASS=X,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//             REGION=4M,TIME=(10,0),
//             RESTART=STEP010
//*****************************************************************
//* CABIN11R - STANDALONE RERUN OF CABING11 (SUSPENSE RECYCLE AND *
//* REINJECTION).  RESTART=STEP010 - THIS IS THE ONLY STEP, BUT   *
//* OPERATIONS RUNBOOK CAB-OPS-014 STANDARDISES RESTART= ON EVERY *
//* SUSPENSE-FAMILY JOB SO THE SAME RESTART COMMAND WORKS ACROSS  *
//* THE WHOLE FAMILY REGARDLESS OF HOW MANY STEPS A GIVEN MEMBER  *
//* HAS.                                                          *
//*****************************************************************
//*
//STEP010  EXEC CABPINGT,PGM=CABING11,CYCLE=&CYCLE,
//             BILLPER=&BILLPER,RUNID=&RUNID,MODE=&RERUN
//STEP010.SUSIN   DD DSN=TELCABS.CABS.USAGE.SUSPENSE(0),DISP=SHR
//STEP010.CARRMST DD DSN=TELCABS.CABS.CARRIER,DISP=SHR
//STEP010.EDTOUT   DD DSN=TELCABS.CABS.USAGE.EDITED(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(5,5),RLSE),UNIT=SYSDA,
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=6000)
//STEP010.RCYOUT   DD DSN=TELCABS.CABS.USAGE.RECYCLE(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(5,5),RLSE),UNIT=SYSDA,
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=6000)
//
