//CABS6300 JOB (CABS,BILL),'SETTLEMENT POSITION AND UNBILLED',
//             CLASS=C,MSGCLASS=X,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID,REGION=0M,TIME=1440
//*****************************************************************
//* CABS6300 - SETTLEMENT POSITION AND UNBILLED USAGE REPORTS     *
//*                                                               *
//* SETLIN POINTS AT TELCABS.SETL.SETTLE.ALL, A DATASET OWNED BY  *
//* THE SETTLEMENT APPLICATION.                                   *
//*****************************************************************
//STEP010  EXEC CABPRPTB,
//             PGMNAME=CABRPT05,
//             CYCLE=%%CYCLDT,
//             BILLPER=%%BILLPR,
//             RUNID=%%RUNID,
//             JOBNM=CABS6300,
//             STEPNM=STEP010,
//             INGDG='0',
//             OUTGDG='+1'
//RPTSTEP.CTLIN    DD DUMMY
//RPTSTEP.PROOFIN  DD DUMMY
//RPTSTEP.BDTLIN   DD DUMMY
//RPTSTEP.SETLIN   DD DSN=TELCABS.SETL.SETTLE.ALL(-1),DISP=SHR
//RPTSTEP.POSOUT   DD SYSOUT=*
//RPTSTEP.SYSIN    DD *
RN%%RUNID  %%CYCLDT%%BILLPR00CABS6300STEP010YY%%SETPER%%KINDSL%%MINPOS%%DSPSW
/*
//*
//STEP020  EXEC CABPRPTB,
//             PGMNAME=CABRPT07,
//             CYCLE=%%CYCLDT,
//             BILLPER=%%BILLPR,
//             RUNID=%%RUNID,
//             JOBNM=CABS6300,
//             STEPNM=STEP020,
//             INGDG='0',
//             OUTGDG='+1'
//RPTSTEP.CTLIN    DD DUMMY
//RPTSTEP.PROOFIN  DD DUMMY
//RPTSTEP.BDTLIN   DD DUMMY
//RPTSTEP.CARRMST  DD DUMMY
//RPTSTEP.RATIN    DD DSN=TELCABS.CABS.RATED.JUR(0),DISP=SHR
//RPTSTEP.TRIGIN   DD DSN=TELCABS.CABS.BILLTRIG(0),DISP=SHR
//         DD DSN=TELCABS.CABS.BILLSKIP(0),DISP=SHR
//RPTSTEP.UNBOUT   DD SYSOUT=*
//RPTSTEP.SYSIN    DD *
RN%%RUNID  %%CYCLDT%%BILLPR00CABS6300STEP020YY%%AGELIM%%RSNSEL%%MINVAL%%DTLSW
/*
//
