//CABS3000 JOB (CABS,BILL),'SETTLEMENT STATEMENTS',
//             CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID,REGION=0M,TIME=1440
//*****************************************************************
//* CABS3000 - SETTLEMENT STATEMENT GENERATOR                     *
//*                                                               *
//* SECOND USE OF THE NETTING FRAGMENT.  THE STATEMENT JOB        *
//* PASSES A DIFFERENT PROGRAM AND OVERRIDES NETIN TO READ THE    *
//* GENERATION CABS2800 CREATED A FEW MINUTES EARLIER.  THE       *
//* INVOICE NUMBER PRINTED ON THE STATEMENT COMES FROM THE CABS   *
//* BILL HEADER FILE.                                             *
//* PROC LIBRARY MEMBERS ARE OWNED BY OPERATIONS SUPPORT.         *
//* DD OVERRIDES ARE AGREED WITH OPERATIONS SUPPORT.              *
//* THE INTERFACE AGREEMENT IS HELD BY THE APPLICATION OWNER.     *
//*****************************************************************
//STEP010  EXEC CABPNETT,
//             PGMNAME=CABSET11,
//             CYCLE=%%CYCLDT,
//             BILLPER=%%BILLPR,
//             RUNID=%%RUNID,
//             NETPER=%%NETPER,
//             SUPZERO=%%SUPZRO,
//             STMTDT=%%STMTDT,
//             INGDG='0'
//*
//NETTSTEP.SETLIN  DD DUMMY,DCB=(RECFM=FB,LRECL=180,BLKSIZE=1800)
//NETTSTEP.NETIN   DD DSN=TELCABS.SETL.NET(0),DISP=SHR
//NETTSTEP.BILLHDR DD DSN=TELCABS.CABS.BILLHDR,DISP=SHR
//NETTSTEP.STMTOUT DD DSN=TELCABS.SETL.STATEMENT(+1),
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=0)
//NETTSTEP.SYSIN   DD *
RN%%RUNID  %%CYCLDT%%BILLPR00CABS3000NETTSTEPNN%%STMTDTY
/*
//
