//CABPRPT  PROC CYCLE=000000,CLASS=A,FCB=STD1,UCS=PN
//*****************************************************************
//* CABPRPT - PRINT / REPORT PROC.  SYSOUT CLASS AND FCB/UCS     *
//* ARE SYMBOLIC SO NIGHT-SHIFT PRINTING CAN ROUTE TO A          *
//* DIFFERENT PRINTER CLASS WITHOUT CHANGING THE MEMBER.         *
//*****************************************************************
//STEP1    EXEC PGM=CABING07,REGION=2M
//STEPLIB  DD DSN=TELCABS.CABS.LOADLIB,DISP=SHR
//         DD DSN=TELCABS.COMMON.LOADLIB,DISP=SHR
//RPTOUT   DD SYSOUT=&CLASS,FCB=&FCB,UCS=&UCS
//SYSOUT   DD SYSOUT=*
