//CABPFMTM PROC PGMNAME=,CYCLE=,BILLPER=,RUNID=,RERUN=00,
//             JOBNM=,STEPNM=MEDSTEP,EDIVER=,SENDID=,
//             SEGTRM='~',ELMSEP='*',MEDIA=T,VOLSER=,
//             LABTXT=,FORMID=,TRAY=1,CAMP=,INSSW=N,
//             INGDG='0',OUTGDG='+1',
//             LOADLIB=TELCABS.CABS.LOADLIB
//*****************************************************************
//* CABPFMTM - MEDIA, EDI AND PRINT CONTROL FRAGMENT              *
//*                                                               *
//* USED BY CABS5300 (EDI), CABS5400 (TAPE) AND CABS5500 (PRINT   *
//* CONTROL AND MESSAGE INSERT).  EVERY JOB OVERRIDES THE OUTPUT  *
//* DD BECAUSE THE THREE PRODUCE DIFFERENT KINDS OF FILE.         *
//* SHARED MEMBERS ARE CHANGED THROUGH OPERATIONS SUPPORT ONLY.   *
//*                                                               *
//* VOLSER IS ALLOCATED BY THE TAPE LIBRARY AND SUBSTITUTED AT    *
//* SUBMISSION.  EDIVER AND SENDID CHANGE BY TRADING PARTNER.     *
//* NONE OF THEM HAS A DEFAULT.                                   *
//*                                                               *
//* THE SEGMENT TERMINATOR AND ELEMENT SEPARATOR ARE CODED AS THE *
//* LITERALS ~ AND * ON THE CONTROL CARD BELOW, THE SAME WAY THE  *
//* PRODUCTION OVERRIDE CARDS CODE THEM.  SEGTRM AND ELMSEP STAY  *
//* ON THE PROC STATEMENT AS THE DOCUMENTED DEFAULTS.  THE CARD   *
//* IMAGE IS 80 BYTES AND WILL NOT HOLD TWELVE SYMBOLICS.         *
//*****************************************************************
//MEDSTEP  EXEC PGM=&PGMNAME,REGION=8M,
//             PARM='&CYCLE.&BILLPER'
//STEPLIB  DD DSN=TELCABS.CABS.EMERG.LOADLIB,DISP=SHR
//         DD DSN=&LOADLIB,DISP=SHR
//         DD DSN=TELCABS.PRINT.LOADLIB,DISP=SHR
//         DD DSN=TELCABS.COMMON.LOADLIB,DISP=SHR
//         DD DSN=SYS1.COB2LIB,DISP=SHR
//BDTLIN   DD DSN=TELCABS.CABS.BILLDTL.SEQ(&INGDG),DISP=SHR
//BHDRIN   DD DSN=TELCABS.CABS.BILLHDR.FIN(&INGDG),DISP=SHR
//MSGIN    DD DSN=TELCABS.CABS.BILLMSG,DISP=SHR
//EDIOUT   DD DSN=TELCABS.CABS.EDI811(&OUTGDG),
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(CYL,(30,15),RLSE),
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)
//CTLOUT   DD DSN=TELCABS.CABS.CONTROL(&OUTGDG),
//             DISP=(MOD,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(5,5),RLSE),
//             DCB=(RECFM=FB,LRECL=180,BLKSIZE=0)
//SUSPOUT  DD DSN=TELCABS.CABS.BILL.SUSP(&OUTGDG),
//             DISP=(MOD,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(15,15),RLSE),
//             DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)
//REPORT   DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=D
//SYSIN    DD *
RN&RUNID&CYCLE&BILLPER&RERUN&JOBNM&STEPNM&INSSW&MEDIA&EDIVER&SENDID~*
/*
//         PEND
